In [6]:
import sqlite3
import pandas as pd

In [19]:
conexao = sqlite3.connect('banco_womakers')
cursor = conexao.cursor()

# Exercícios Banco de Dados
**Semana 07: Banco de Dados SQL**

In [ ]:
# 1. Criação da tabela "alunos"

query= '''
CREATE TABLE alunos (
    id INTEGER PRIMARY KEY,
    nome TEXT,
    idade INTEGER,
    curso TEXT
);'''

cursor.execute(query)
conexao.commit()

In [26]:
# 2. Inserção de 5 registros na tabela "alunos"

query2 = '''
INSERT INTO alunos (id, nome, idade, curso) VALUES (5, 'Eduardo', 23, 'Letras');

'''
cursor.execute(query2)
conexao.commit()

In [30]:
# 3. Consultas Básicas
# a) Selecionar todos os registros da tabela "alunos"

query3 = '''
SELECT * FROM alunos;'''
pd.read_sql(query3,conexao)

   id     nome  idade       curso
0   1      Ana     21  Engenharia
1   2    Bruno     19    Medicina
2   3   Carlos     22  Engenharia
3   4    Diana     20     Direito
4   5  Eduardo     23      Letras

In [31]:
# b) Selecionar o nome e a idade dos alunos com mais de 20 anos

query4 = '''
SELECT nome, idade FROM alunos WHERE idade > 20;'''

pd.read_sql(query4,conexao)

      nome  idade
0      Ana     21
1   Carlos     22
2  Eduardo     23

In [33]:
#c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética
query5 = '''
SELECT * FROM alunos 
WHERE curso = 'Engenharia' 
ORDER BY nome;'''

pd.read_sql(query5,conexao)

   id    nome  idade       curso
0   1     Ana     21  Engenharia
1   3  Carlos     22  Engenharia

In [38]:
# d) Contar o número total de alunos na tabela

query6 = '''
SELECT COUNT (*) FROM alunos;'''

pd.read_sql(query6,conexao)

   COUNT (*)
0          5

In [40]:
# 4. Atualização e Remoção
# a) Atualizar a idade de um aluno específico na tabela

query7 = '''
UPDATE alunos SET idade = 24 WHERE id = 3;'''

cursor.execute(query7)
conexao.commit()

# b) Remover um aluno pelo seu ID

query8 = '''
DELETE FROM alunos WHERE id = 2;
'''

cursor.execute(query8)
conexao.commit()

In [41]:
# 5. Criar a tabela "clientes" e inserir dados


query9 = '''CREATE TABLE clientes (
    id INTEGER PRIMARY KEY,
    nome TEXT,
    idade INTEGER,
    saldo FLOAT
);'''

cursor.execute(query9)
conexao.commit()

In [ ]:
query10 = '''
INSERT INTO clientes (id, nome, idade, saldo) VALUES (3, 'Carol', 40, 2500.75);'''

cursor.execute(query10)
conexao.commit()

In [46]:
# 6. Consultas e Funções Agregadas
# a) Selecionar o nome e a idade dos clientes com idade superior a 30 anos

query11 = '''
SELECT nome, idade FROM clientes WHERE idade > 30;
'''

pd.read_sql(query11,conexao)

    nome  idade
0  Alice     35
1  Carol     40

In [48]:
# b) Calcular o saldo médio dos clientes

query12 = '''
SELECT AVG(saldo) AS saldo_medio FROM clientes;'''

# c) Encontrar o cliente com o saldo máximo

query13 = '''
SELECT nome, saldo FROM clientes 
ORDER BY saldo DESC 
LIMIT 1;'''

# d) Contar quantos clientes têm saldo acima de 1000

query14 = '''
SELECT COUNT(*) FROM clientes 
WHERE saldo > 1000;'''

query12 = pd.read_sql(query12,conexao)
query13 = pd.read_sql(query13,conexao)
query14 = pd.read_sql(query14,conexao)

In [50]:
query12

   saldo_medio
0      1583.75

In [51]:
query13

    nome    saldo
0  Carol  2500.75

In [52]:
query14

   COUNT(*)
0         2

In [53]:
# 7. Atualização e Remoção com Condições
# a) Atualizar o saldo de um cliente específico

query15 = '''
UPDATE clientes SET saldo = 3000.00
WHERE id = 3;
'''
cursor.execute(query15)
conexao.commit()

# b) Remover um cliente pelo seu ID

query16 = '''
DELETE FROM clientes
WHERE id = 2;
'''

cursor.execute(query16)
conexao.commit()

In [54]:
# 8. Criação da tabela "compras" e junção de tabelas

query17 = '''
CREATE TABLE compras (
    id INTEGER PRIMARY KEY,
    cliente_id INTEGER,
    produto TEXT,
    valor REAL,
    FOREIGN KEY (cliente_id) REFERENCES clientes(id)
);'''
cursor.execute(query17)
conexao.commit()

In [59]:
# Inserindo dados
query18 = '''
INSERT INTO compras (id, cliente_id, produto, valor) VALUES (3, 3, 'Tablet', 500.00);
'''

cursor.execute(query18)
conexao.commit()

In [60]:
query = '''
SELECT * FROM compras 
'''

pd.read_sql(query,conexao)

   id  cliente_id     produto   valor
0   1           1      Laptop  1200.0
1   2           1  Smartphone   800.0
2   3           3      Tablet   500.0

In [62]:
conexao.close()

In [61]:
# Consulta para exibir o nome do cliente, o produto e o valor de cada compra

query18= '''
SELECT clientes.nome, compras.produto, compras.valor
FROM compras
JOIN clientes ON compras.cliente_id = clientes.id; 
'''

pd.read_sql(query18,conexao)

    nome     produto   valor
0  Alice      Laptop  1200.0
1  Alice  Smartphone   800.0
2  Carol      Tablet   500.0